app/controllers/questions_controller.rb

  def create
    if logged_in?
      @question = Question.new(question_params)
      @question.user = current_user
      if @question.save
---
INSERT INTO "questions" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Liams Post"], ["body", "YAYYS"], ["user_id", 1], ["created_at", "2016-03-04 16:15:43.488297"], ["updated_at", "2016-03-04 16:15:43.488297"]]